{"class_name": "Model", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 51, 4], "name": "input_64", "sparse": false}, "inbound_nodes": [], "name": "input_64"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_125", "kernel_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "bias_constraint": null, "dtype": "float32", "activation": "elu", "trainable": true, "data_format": "channels_last", "filters": 16, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 51, 4], "use_bias": true, "activity_regularizer": null, "kernel_size": [5]}, "inbound_nodes": [[["input_64", 0, 0, {}]]], "name": "conv1d_125"}, {"class_name": "GroupNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "group_normalization_125", "epsilon": 1e-05, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "groups": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "center": true}, "inbound_nodes": [[["conv1d_125", 0, 0, {}]]], "name": "group_normalization_125"}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_123", "trainable": true, "data_format": "channels_last", "pool_size": [4], "padding": "valid", "strides": [2]}, "inbound_nodes": [[["group_normalization_125", 0, 0, {}]]], "name": "max_pooling1d_123"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_126", "kernel_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "bias_constraint": null, "dtype": "float32", "activation": "elu", "trainable": true, "data_format": "channels_last", "filters": 16, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 51, 4], "use_bias": true, "activity_regularizer": null, "kernel_size": [5]}, "inbound_nodes": [[["max_pooling1d_123", 0, 0, {}]]], "name": "conv1d_126"}, {"class_name": "GroupNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "group_normalization_126", "epsilon": 1e-05, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "groups": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "center": true}, "inbound_nodes": [[["conv1d_126", 0, 0, {}]]], "name": "group_normalization_126"}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_124", "trainable": true, "data_format": "channels_last", "pool_size": [4], "padding": "valid", "strides": [2]}, "inbound_nodes": [[["group_normalization_126", 0, 0, {}]]], "name": "max_pooling1d_124"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_62", "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_124", 0, 0, {}]]], "name": "flatten_62"}, {"class_name": "Dropout", "config": {"rate": 0.35, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_62"}, "inbound_nodes": [[["flatten_62", 0, 0, {}]]], "name": "dropout_62"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_92", "kernel_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "activation": "elu", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_62", 0, 0, {}]]], "name": "dense_92"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_93", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_92", 0, 0, {}]]], "name": "dense_93"}], "input_layers": [["input_64", 0, 0]], "output_layers": [["dense_93", 0, 0]], "name": "model_62"}, "backend": "tensorflow"}