{"class_name": "Model", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 51, 4], "name": "input_69", "sparse": false}, "inbound_nodes": [], "name": "input_69"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_135", "kernel_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "bias_constraint": null, "dtype": "float32", "activation": "elu", "trainable": true, "data_format": "channels_last", "filters": 16, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 51, 4], "use_bias": true, "activity_regularizer": null, "kernel_size": [5]}, "inbound_nodes": [[["input_69", 0, 0, {}]]], "name": "conv1d_135"}, {"class_name": "GroupNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "group_normalization_135", "epsilon": 1e-05, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "groups": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "center": true}, "inbound_nodes": [[["conv1d_135", 0, 0, {}]]], "name": "group_normalization_135"}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_133", "trainable": true, "data_format": "channels_last", "pool_size": [4], "padding": "valid", "strides": [2]}, "inbound_nodes": [[["group_normalization_135", 0, 0, {}]]], "name": "max_pooling1d_133"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_136", "kernel_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "bias_constraint": null, "dtype": "float32", "activation": "elu", "trainable": true, "data_format": "channels_last", "filters": 16, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 51, 4], "use_bias": true, "activity_regularizer": null, "kernel_size": [5]}, "inbound_nodes": [[["max_pooling1d_133", 0, 0, {}]]], "name": "conv1d_136"}, {"class_name": "GroupNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "group_normalization_136", "epsilon": 1e-05, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "groups": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "center": true}, "inbound_nodes": [[["conv1d_136", 0, 0, {}]]], "name": "group_normalization_136"}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_134", "trainable": true, "data_format": "channels_last", "pool_size": [4], "padding": "valid", "strides": [2]}, "inbound_nodes": [[["group_normalization_136", 0, 0, {}]]], "name": "max_pooling1d_134"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_67", "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_134", 0, 0, {}]]], "name": "flatten_67"}, {"class_name": "Dropout", "config": {"rate": 0.35, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_67"}, "inbound_nodes": [[["flatten_67", 0, 0, {}]]], "name": "dropout_67"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_102", "kernel_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "activation": "elu", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_67", 0, 0, {}]]], "name": "dense_102"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_103", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_102", 0, 0, {}]]], "name": "dense_103"}], "input_layers": [["input_69", 0, 0]], "output_layers": [["dense_103", 0, 0]], "name": "model_67"}, "backend": "tensorflow"}